In [4]:
import pandas as pd

In [5]:
#importando um módulo
from sqlalchemy import create_engine

In [9]:
# Definir as credenciais
import urllib.parse

user = 'root'
password = urllib.parse.quote_plus('senai@123')
host = 'localhost'
database = 'schooltracker'

# Criar URL de conexão
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# Criar a conexão com o create_engine()
engine = create_engine(connection_string)

# Escrever consulta SQL
query_alunos = "SELECT * FROM aluno"

# Criar dataframe
df_alunos = pd.read_sql(query_alunos,engine)
# Mostrar 5 primeiros
df_alunos.head()

   id        ra  nome  tempoestudo  rendafamiliar
0   1  00034549  None          NaN            NaN
1   2  00034547  None          NaN            NaN
2   3  00034548  None          NaN            NaN
3   6  00034550  None          NaN            NaN
4   7  00034551  None          NaN            NaN

# Quais bibliotecas um cientista de dados utiliza?

- Pandas
- Numpy
- Fundamentos de IA (Scikit-Learn)

- Material didátocp
- Pandas e Numpy (notebook)
- Scikit-Learn (Apostila do SENAI)

- Pandas: ciência de dados
- Sckit-Learn: Elaboração de modelos de IA
- NumPy: matemática

- 05/08/2024
    - Carregar dados (ok)
    - Salvar um dataframe

In [10]:
# Eu salvei o DataFrame!
csv_file = 'alunos.csv'
df_alunos.to_csv(csv_file,index=False)

In [8]:
# Salve o DataFrame em formato JSON
json_file = 'alunos.json'
df_alunos.to_json(json_file,index=False)

In [9]:
# Salve o DataFrame em formato xlsx
xlsx_file = 'alunos.xlsx'
df_alunos.to_excel(xlsx_file,index=False)

# Um novo DataFrame

In [11]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

In [18]:
df_tempo_renda = df_alunos[['tempoestudo','rendafamiliar']]
df_tempo_renda

     tempoestudo  rendafamiliar
0            NaN            NaN
1            NaN            NaN
2            NaN            NaN
3            NaN            NaN
4            NaN            NaN
..           ...            ...
111         30.0         6500.0
112         25.0         6600.0
113         22.0         6700.0
114         28.0         6800.0
115         24.0         6900.0

[116 rows x 2 columns]

In [12]:
df_renda = df_alunos['rendafamiliar']
print(df_renda)

0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
        ...
111    6500.0
112    6600.0
113    6700.0
114    6800.0
115    6900.0
Name: rendafamiliar, Length: 116, dtype: float64

In [13]:
type(df_renda)

pandas.core.series.Series

# Revisando funções básicas
# 06/08/2024

- 1 - Retorne o dataframe da última aula com as duas primeiras linhas como amostras.

In [18]:
df_exercicio1 = df_alunos.head(2)
df_exercicio1

   id        ra  nome  tempoestudo  rendafamiliar
0   1  00034549  None          NaN            NaN
1   2  00034547  None          NaN            NaN

- 2 - Agora retorne as duas últimas linhas da amostra.

In [19]:
df_exercicio2 = df_alunos.tail(2)
df_exercicio2

      id        ra               nome  tempoestudo  rendafamiliar
114  118  00177231  Patrícia Carvalho         28.0         6800.0
115  119  00177232      Renato Santos         24.0         6900.0

- 3 - Retorne uma tupla com o número de linhas e colunas.

In [21]:
df_alunos.shape

(116, 5)

- 4 - Retorne as informações gerais do dataframe

In [23]:
df_alunos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 116 entries, 0 to 115
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             116 non-null    int64
 1   ra             116 non-null    object
 2   nome           50 non-null     object
 3   tempoestudo    51 non-null     float64
 4   rendafamiliar  51 non-null     float64
dtypes: float64(2), int64(1), object(2)
memory usage: 4.7+ KB

In [29]:
qtde = len(df_alunos)
if qtde <= 116:
    print(f'quantidade: {qtde} dentro do ideal')

quantidade: 116 dentro do ideal

- 5 - Retorne as colunas.

In [24]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

- 6 - Retorne as informações apenas da colune renda familiar.

In [25]:
df_renda = df_alunos['rendafamiliar']
df_renda

0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
        ...
111    6500.0
112    6600.0
113    6700.0
114    6800.0
115    6900.0
Name: rendafamiliar, Length: 116, dtype: float64

- 7 - Mostre os tipos com dtypes

In [30]:
df_alunos.dtypes

id                 int64
ra                object
nome              object
tempoestudo      float64
rendafamiliar    float64
dtype: object

- 8 - Crie um dataframe da tabela diario de bordo e mostre os valores

In [62]:
query_avaliacao = 'SELECT * FROM avaliacao'

df_avaliacao = pd.read_sql(query_avaliacao,engine)

df_avaliacao.head()

   fk_aluno_id  nota4  id  nota3  nota2  nota1
0           40     17   1     14     18     10
1           34     25   2     23     20     17
2           23     17   3     21     18     19
3           12     17   4     14     23     25
4           37     13   5     12     21     15

In [53]:
query_diario = 'SELECT * FROM diariobordo'

df_diario = pd.read_sql(query_diario,engine)

df_diario.head()

,id,texto,datahora,fk_aluno_id
0,6,Hoje aprendemos a inserir no banco dados,2024-07-31 15:49:00,25
1,7,Hoje finalizamos a criação das tabelas populam...,2024-07-31 17:55:00,67
2,8,Hoje estudamos técnicas de normalização de dad...,2024-08-01 09:30:00,12
3,9,Aprendemos sobre algoritmos de clustering para...,2024-08-01 11:15:00,22
4,10,Exploramos diferentes métodos de validação cru...,2024-08-01 14:00:00,35

In [54]:
# 3 Primeiras linhas
df_diario1 = df_diario.head(3)
df_diario1

,id,texto,datahora,fk_aluno_id
0,6,Hoje aprendemos a inserir no banco dados,2024-07-31 15:49:00,25
1,7,Hoje finalizamos a criação das tabelas populam...,2024-07-31 17:55:00,67
2,8,Hoje estudamos técnicas de normalização de dad...,2024-08-01 09:30:00,12

In [55]:
# 4 Úlçtimas linhas
df_diario2 = df_diario.tail(4)
df_diario2

,id,texto,datahora,fk_aluno_id
27,33,Estudamos as diferenças entre aprendizado supe...,2024-08-10 09:30:00,15
28,34,"Exploramos a aplicação de modelos generativos,...",2024-08-10 11:45:00,38
29,35,Implementamos técnicas de feature engineering ...,2024-08-10 14:00:00,24
30,36,Hoje discutimos a importância da interpretação...,2024-08-11 09:00:00,16

In [56]:
# Mostrando números de linhas e colunas 

df_diario.shape

(31, 4)

In [58]:
# Salvando o dataframe em formato JSON
json_file = 'diariobordo.json'
df_diario.to_json(json_file,index=False)

# Fazendo um join

- Use o comando merge
- Criar uma variável - resultado.
- pd.merge(dataframe1,dataframe2, tipo_uniao, qual chave esquerda, qual chave da direita) - queremos unir
- Qual o tipo de união: how='inner'
- O parametro how define o tipo de join que estamos realizando.
- inner significa que queremos um join interno, o que resulta em apenas as linhas que tem correspondência em ambos os dataframes.

In [61]:
resultado = pd.merge(df_diario,df_alunos,how='left',left_on='fk_aluno_id',right_on='id')

resultado_selecionado = resultado[['texto', 'datahora', 'ra']]

resultado_selecionado.head()

,texto,datahora,ra
0,Hoje aprendemos a inserir no banco dados,2024-07-31 15:49:00,00034569
1,Hoje finalizamos a criação das tabelas populam...,2024-07-31 17:55:00,00177181
2,Hoje estudamos técnicas de normalização de dad...,2024-08-01 09:30:00,00034556
3,Aprendemos sobre algoritmos de clustering para...,2024-08-01 11:15:00,00034566
4,Exploramos diferentes métodos de validação cru...,2024-08-01 14:00:00,00034579

- Crie uma junção do dataframe aluno com avaliação. Mostre as notas e o RA do aluno.

In [73]:
resultado2 = pd.merge(df_alunos,df_avaliacao,how='inner',left_on='id',right_on='fk_aluno_id')

resultado_selecionado2 = resultado2[['ra', 'nota1', 'nota2', 'nota3', 'nota4']]

resultado_selecionado2.head(20)

          ra  nota1  nota2  nota3  nota4
0   00034549     12     15     18     20
1   00034549     12     15     18     20
2   00034549     12     15     18     20
3   00034547     14     16     19     22
4   00034547     14     16     19     22
5   00034547     14     16     19     22
6   00034548     11     13     17     21
7   00034548     11     13     17     21
8   00034548     11     13     17     21
9   00034550     14     19     21     24
10  00034551     11     16     18     20
11  00034552     13     17     19     22
12  00034553     12     14     20     23
13  00034555     15     18     21     24
14  00034556     25     23     14     17
15  00034556     10     13     17     22
16  00034557     11     16     19     23
17  00034558     14     17     20     24
18  00034559     12     15     19     21
19  00034560     13     18     22     23